# MinRange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorValue..::..MinRange Property
ElectricalDemandFactorValue Class See Also
---
The minimum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the minimum range will be 1.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double MinRange { get; set; }
```

Visual Basic
---
```text
Public Property MinRange As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinRange {
	double get ();
	void set (double value);
}
```

# See Also
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace